tutorials/swak4Foam/groovyBC/sprinklingInlet/constant/polyMesh/blockMeshDict
// /*--------------------------------*- C++ -*----------------------------------*\
// | =========                 |                                                 |
// | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
// |  \\    /   O peration     | Version:  1.7.1                                 |
// |   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
// |    \\/     M anipulation  |                                                 |
// \*---------------------------------------------------------------------------*/
// FoamFile
// {
//     version     2.0;
//     format      ascii;
//     class       dictionary;
//     object      blockMeshDict;
// }
// // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// 
// convertToMeters 1;
// 
// vertices        
// (
//     (0 0 0)
//     (0.25 0 0)
//     (0 0.25 0)
//     (0.25 0.25 0)
//     (0 0 0.01)
//     (0.25 0 0.01)
//     (0 0.25 0.01)
//     (0.25 0.25 0.01)
//     (0.1 0.125 0)
//     (0.15 0.125 0)
//     (0.125 0.1 0)
//     (0.125 0.15 0)
//     (0.1 0.125 0.01)
//     (0.15 0.125 0.01)
//     (0.125 0.1 0.01)
//     (0.125 0.15 0.01)
//     (0 0.125 0)
//     (0.25 0.125 0)
//     (0 0.125 0.01)
//     (0.25 0.125 0.01)
// );
// 
// blocks          
// (
//     hex (0 1 3 2 4 5 7 6) (100 100 1) simpleGrading (1 1 1)
// );
// 
// edges           
// (
//      arc 8 9 (0.125 0.1 0)
//      arc 10 11 (0.125 0.15 0)
//      arc 12 13 (0.125 0.1 0.01)
//      arc 14 15 (0.125 0.15 0.01)
// );
// 
// patches         
// (
//     wall wall 
//     (
//         (0 4 6 2)
//         (0 1 5 4)
//         (1 5 7 3)
//     )
//     patch atmosphere
//     (
//         (2 3 7 6)
//     )
// );
// 
// mergePatchPairs
// (
// );
// 
// // ************************************************************************* //
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0.5 0 0)			//0
    (1 0 0)
    (2 0 0)
    (2 0.707107 0)		//3
    (0.707107 0.707107 0)
    (0.353553 0.353553 0)
    (2 2 0)			//6
    (0.707107 2 0)
    (0 2 0)
    (0 1 0)			//9
    (0 0.5 0)
    (0.5 0 0.1)
    (1 0 0.1)			//12
    (2 0 0.1)
    (2 0.707107 0.1)
    (0.707107 0.707107 0.1)	//15
    (0.353553 0.353553 0.1)
    (2 2 0.1)
    (0.707107 2 0.1)		//18
    (0 2 0.1)
    (0 1 0.1)
    (0 0.5 0.1)			//21
    (-0.5 0 0)			//22
    (-1 0 0)
    (-2 0 0)
    (-2 0.707107 0)
    (-0.707107 0.707107 0)
    (-0.353553 0.353553 0)
    (-2 2 0)
    (-0.707107 2 0)
    (-0.5 0 0.1)
    (-1 0 0.1)
    (-2 0 0.1)
    (-2 0.707107 0.1)
    (-0.707107 0.707107 0.1)
    (-0.353553 0.353553 0.1)
    (-2 2 0.1)
    (-0.707107 2 0.1)//
    (2 -0.707107 0)
    (0.707107 -0.707107 0)
    (0.353553 -0.353553 0)
    (2 -2 0)
    (0.707107 -2 0)
    (0 -2 0)
    (0 -1 0)
    (0 -0.5 0)
    (2 -0.707107 0.1)
    (0.707107 -0.707107 0.1)
    (0.353553 -0.353553 0.1)
    (2 -2 0.1)
    (0.707107 -2 0.1)
    (0 -2 0.1)
    (0 -1 0.1)
    (0 -0.5 0.1)//
    (-2 -0.707107 0)
    (-0.707107 -0.707107 0)
    (-0.353553 -0.353553 0)
    (-2 -2 0)
    (-0.707107 -2 0)
    (-2 -0.707107 0.1)
    (-0.707107 -0.707107 0.1)
    (-0.353553 -0.353553 0.1)
    (-2 -2 0.1)
    (-0.707107 -2 0.1)

);

blocks          
(
    hex (5 4 9 10 16 15 20 21) (10 10 1) simpleGrading (1 1 1)
    hex (0 1 4 5 11 12 15 16) (10 10 1) simpleGrading (1 1 1)
    hex (1 2 3 4 12 13 14 15) (20 10 1) simpleGrading (1 1 1)
    hex (4 3 6 7 15 14 17 18) (20 20 1) simpleGrading (1 1 1)
    hex (9 4 7 8 20 15 18 19) (10 20 1) simpleGrading (1 1 1)//
    hex (27 10 9 26 35 21 20 34) (10 10 1) simpleGrading (1 1 1)
    hex (23 22 27 26 31 30 35 34) (10 10 1) simpleGrading (1 1 1)
    hex (24 23 26 25 32 31 34 33) (20 10 1) simpleGrading (1 1 1)
    hex (25 26 29 28 33 34 37 36) (20 20 1) simpleGrading (1 1 1)
    hex (26 9 8 29 34 20 19 37) (10 20 1) simpleGrading (1 1 1)//
    hex (44 39 40 45 52 47 48 53) (10 10 1) simpleGrading (1 1 1)
    hex (40 39 1 0 48 47 12 11) (10 10 1) simpleGrading (1 1 1)
    hex (39 38 2 1 47 46 13 12) (20 10 1) simpleGrading (1 1 1)
    hex (42 41 38 39 50 49 46 47) (20 20 1) simpleGrading (1 1 1)
    hex (43 42 39 44 51 50 47 52) (10 20 1) simpleGrading (1 1 1)//
    hex (55 44 45 56 60 52 53 61) (10 10 1) simpleGrading (1 1 1)
    hex (55 56 22 23 60 61 30 31) (10 10 1) simpleGrading (1 1 1)
    hex (58 43 44 55 63 51 52 60) (10 20 1) simpleGrading (1 1 1)
    hex (57 58 55 54 62 63 60 59) (20 20 1) simpleGrading (1 1 1)
    hex (54 55 23 24 59 60 31 32) (20 10 1) simpleGrading (1 1 1)
);

edges           
(
    arc 0 5 (0.469846 0.17101 0)
    arc 5 10 (0.17101 0.469846 0)
    arc 1 4 (0.939693 0.34202 0)
    arc 4 9 (0.34202 0.939693 0)
    arc 11 16 (0.469846 0.17101 0.1)
    arc 16 21 (0.17101 0.469846 0.1)
    arc 12 15 (0.939693 0.34202 0.1)
    arc 15 20 (0.34202 0.939693 0.1)//
    arc 22 27 (-0.469846 0.17101 0)
    arc 27 10 (-0.17101 0.469846 0)
    arc 23 26 (-0.939693 0.34202 0)
    arc 26 9 (-0.34202 0.939693 0)
    arc 30 35 (-0.469846 0.17101 0.1)
    arc 35 21 (-0.17101 0.469846 0.1)
    arc 31 34 (-0.939693 0.34202 0.1)
    arc 34 20 (-0.34202 0.939693 0.1)//
    arc 0 40 (0.469846 -0.17101 0)
    arc 40 45 (0.17101 -0.469846 0)
    arc 1 39 (0.939693 -0.34202 0)
    arc 39 44 (0.34202 -0.939693 0)
    arc 11 48 (0.469846 -0.17101 0.1)
    arc 48 53 (0.17101 -0.469846 0.1)
    arc 12 47 (0.939693 -0.34202 0.1)
    arc 47 52 (0.34202 -0.939693 0.1)//
    arc 22 56 (-0.469846 -0.17101 0)
    arc 56 45 (-0.17101 -0.469846 0)
    arc 23 55 (-0.939693 -0.34202 0)
    arc 55 44 (-0.34202 -0.939693 0)
    arc 30 61 (-0.469846 -0.17101 0.1)
    arc 61 53 (-0.17101 -0.469846 0.1)
    arc 31 60 (-0.939693 -0.34202 0.1)
    arc 60 52 (-0.34202 -0.939693 0.1)
);

patches         
(
    patch wall 
    (
        (2 3 14 13)
        (3 6 17 14)
        (38 2 13 46)
        (41 38 46 49)
        (42 41 49 50)
        (43 42 50 51)
        (58 43 51 63)
        (57 58 63 62)
        (57 54 59 62)
        (54 24 32 59)
        (24 25 33 32)
        (25 28 36 33)
    )
    patch outlet 
    (
        (7 8 19 18)
        (6 7 18 17)
        (8 29 37 19)
        (29 28 36 37)
    )
    patch hole 
    (
        (10 5 16 21)
        (5 0 11 16)
        (10 27 35 21)
        (27 22 30 35)
        (22 56 61 30)
        (56 45 53 61)
        (45 40 48 53)
        (40 0 11 48)
    )
    empty frontAndBack 
    (
        (10 9 4 5)
        (5 4 1 0)
        (1 4 3 2)
        (4 7 6 3)
        (4 9 8 7)
        (21 16 15 20)
        (16 11 12 15)
        (12 13 14 15)
        (15 14 17 18)
        (15 18 19 20)
        (0 1 39 40)
        (11 12 47 48)
        (1 2 38 39)
        (12 13 46 47)
        (44 39 42 43)
        (52 47 50 51)
        (45 40 39 44)
        (53 48 47 52)
        (39 38 41 42)
        (47 46 49 50)
        (10 27 26 9)
        (21 35 34 20)
        (22 23 26 27)
        (30 31 34 35)
        (23 24 25 26)
        (31 32 33 34)
        (9 26 29 8)
        (20 34 37 19)
        (26 25 28 29)
        (34 33 36 37)
        (45 56 55 44)
        (22 23 55 56)
        (30 31 60 61)
        (53 61 60 52)
        (44 55 58 43)
        (52 60 63 51)
        (55 54 57 58)
        (60 59 62 63)
        (23 24 54 55)
        (31 32 59 60)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
